tutorialsDyM/RestingSphereMorphing3D/constant/granularRheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      granaularRheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

granularRheology   on;

granularDilatancy off;

alphaMaxG       alphaMaxG [ 0 0 0 0 0 0 0 ] 0.625;

mus             mus  [ 0 0 0 0 0 0 0 ] 0.4;

mu2             mu2  [ 0 0 0 0 0 0 0 ] 0.7;

I0              I0  [ 0 0 0 0 0 0 0 ] 0.005;

Bphi            Bphi [ 0 0 0 0 0 0 0 ] 1;

n               n [ 0 0 0 0 0 0 0 ] 2.5;

Dsmall          Dsmall [ 0 0 -1 0 0 0 0 ] 1e-6;

BulkFactor      BulkFactor [ 0 0 0 0 0 0 0 ] 0e-1;

relaxPa         relaxPa [ 0 0 0 0 0 0 0 ] 1.e-0;


K_dila          K_dila [ 0 0 0 0 0 0 0 ] 0.0;

alpha_c         alpha_c [ 0 0 0 0 0 0 0 ] 0.585;

FrictionModel   MuIv;

PPressureModel  MuIv;

FluidViscosityModel  BoyerEtAl;

// ************************************************************************* //



